src/test/resources/integrationtest/prediktion/getPrediktion_Model1Request_output_0.44.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:clinicalprocess:healthcond:srs:GetSRSInformationResponder:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:types:2">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetSRSInformationRequest>
         <urn:version>1</urn:version>
         <urn:konsument-id>
            <urn1:root>1.2.752.129.2.1.4.1</urn1:root>
            <urn1:extension>123456</urn1:extension>
         </urn:konsument-id>
         <urn:anvandare-id>
            <urn1:root>1.2.752.129.2.1.4.1</urn1:root>
            <urn1:extension>98765</urn1:extension>
         </urn:anvandare-id>
         <!--Optional:-->
         <urn:prediktionsfaktorer>
            <urn:postnummer>20000</urn:postnummer>
            <!--1 or more repetitions:-->
            <urn:fragasvar>
               <urn:frageid-srs>SA_1_gross</urn:frageid-srs>
               <urn:svarsid-srs>0</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>DP_atStart</urn:frageid-srs>
               <urn:svarsid-srs>false</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>Visits_yearBefore_all_r1_median</urn:frageid-srs>
               <urn:svarsid-srs>LessT2V</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>SA_SyssStart_fct</urn:frageid-srs>
               <urn:svarsid-srs>work</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>fam_cat_4_cat_fct</urn:frageid-srs>
               <urn:svarsid-srs>Married</urn:svarsid-srs>
            </urn:fragasvar>
            <urn:fragasvar>
               <urn:frageid-srs>edu_cat_fct</urn:frageid-srs>
               <urn:svarsid-srs>>12 years</urn:svarsid-srs>
            </urn:fragasvar>
         </urn:prediktionsfaktorer>
         <urn:individer>
            <urn:individ>
               <urn:person-id>198801080214</urn:person-id>
               <urn:diagnos>
                  <urn1:code>X99</urn1:code>
                  <urn1:codeSystem>1.2.752.116.1.1.1.1.3</urn1:codeSystem>
               </urn:diagnos>
               <urn:intyg-id>
                  <urn1:root>root</urn1:root>
                  <urn1:extension>intygsid_placeholder</urn1:extension>
               </urn:intyg-id>
            </urn:individ>
         </urn:individer>
         <urn:utdatafilter>
            <urn:prediktion>true</urn:prediktion>
            <urn:atgardsrekommendation>false</urn:atgardsrekommendation>
            <urn:statistik>false</urn:statistik>
         </urn:utdatafilter>
      </urn:GetSRSInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>